## KANIA PUTRI ANANDA || 2109106006
### TOY DATASET

### Meng-import Library

In [174]:
import pandas as pd
import numpy as np
from prettytable import PrettyTable

dataFrame = pd.read_csv("toy_dataset1.csv")

### Memasukkan Attribute ke dalam Dictionary

In [185]:
info = {
    'jumlah_records' : dataFrame.shape[0],
    'nama_attribute' : [],
    'tipe_objek' : 0,
    'tipe_angka' : 0,
    'nilai_null' : 0
}

info['jumlah_records'] = dataFrame.shape[0]
info['nama_attribute'] = list(dataFrame.columns)
info['nilai_null'] = list(dataFrame.loc[:, dataFrame.isnull().any()].columns)
info['tipe_objek'] = list(dataFrame.select_dtypes(['object']).columns)
info['tipe_angka'] = list(dataFrame.select_dtypes(['int64']).columns)

### Menampilkan ISI DICTIONARY

In [188]:
table = PrettyTable(["Informasi", "Jumlah"])
table.align = "l"

table.add_row(["Record", info['jumlah_records']])
table.add_row(["Nama & Attribut", f"{', '.join(info['nama_attribute'])} ({ len(info['nama_attribute']) })"])
table.add_row(["Tipe Objek", f"{', '.join(info['tipe_objek'])} ({ len(info['tipe_objek']) })"])
table.add_row(["Tipe Angka", f"{', '.join(info['tipe_angka'])} ({ len(info['tipe_angka']) })"])
table.add_row(["Nilai Null", f"{', '.join(info['nilai_null'])} ({ len(info['nilai_null']) })"])


print(table)

+-----------------+------------------------------------------------+
| Informasi       | Jumlah                                         |
+-----------------+------------------------------------------------+
| Record          | 150000                                         |
| Nama & Attribut | Number, City, Gender, Age, Income, Illness (6) |
| Tipe Objek      | City, Gender, Illness (3)                      |
| Tipe Angka      | Number, Age, Income (3)                        |
| Nilai Null      |  (0)                                           |
+-----------------+------------------------------------------------+

### Menampilkan RATA-RATA, STD, MIN, MAX, Q1, Q2, Q3

In [81]:
dataFrame.describe()

              Number            Age         Income
count  150000.000000  150000.000000  150000.000000
mean    75000.500000      44.950200   91252.798273
std     43301.414527      11.572486   24989.500948
min         1.000000      25.000000    -654.000000
25%     37500.750000      35.000000   80867.750000
50%     75000.500000      45.000000   93655.000000
75%    112500.250000      55.000000  104519.000000
max    150000.000000      65.000000  177157.000000

### Menampilkan NILAI KORELASI

In [83]:
dataFrame.corr()

          Number       Age    Income
Number  1.000000 -0.003448  0.410460
Age    -0.003448  1.000000 -0.001318
Income  0.410460 -0.001318  1.000000

### MENGUBAH NILAI menjadi DESIMAL

In [169]:
dataFrame['Income'].astype(float)

0          40367.0
1          45084.0
2          52483.0
3          40941.0
4          50289.0
            ...
149995     93669.0
149996     96748.0
149997    111885.0
149998    111878.0
149999     87251.0
Name: Income, Length: 150000, dtype: float64

### Menampilkan 10 RECORD PERTAMA DARI ATTRIBUTE BERTIPE ANGKA

In [168]:
datahead = dataFrame.select_dtypes(include=np.number)
datahead.head(10)

   Number  Age  Income
0       1   41   40367
1       2   54   45084
2       3   42   52483
3       4   40   40941
4       5   46   50289
5       6   36   50786
6       7   32   33155
7       8   39   30914
8       9   51   68667
9      10   30   50082

### Menyimpan DATASET DENGAN ATTRIBUTE ANGKA ke dalam CSV

In [69]:
dataFrame[{'Number', 'Age', 'Income'}].to_csv("toy_story.csv")

C:\Users\ASUS\AppData\Local\Temp\ipykernel_2016\3908671775.py:1: FutureWarning: Passing a set as an indexer is deprecated and will raise in a future version. Use a list instead.
  dataFrame[{'Number', 'Age', 'Income'}].to_csv("toy_story.csv")